---
type: UIMacroManager
namespace: Autodesk.Revit.UI.Macros
version: 2024
members: 11
tags: [revit-api, class]
---

# UIMacroManager

`Autodesk.Revit.UI.Macros.UIMacroManager` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddModule | 2014 | `public MacroModule AddModule ( ModuleSettings moduleSettings , MacroEnvironment environment )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | EditMacro | 2014 | `public void EditMacro ( Macro macro )` |
| Method | EditModule | 2014 | `public void EditModule ( MacroModule module )` |
| Method | GetMacroManager | — | `` |
| Method | GetUIDocumentMacroSecurityOptions | 2014 | `public static UIDocumentMacroOptions GetUIDocumentMacroSecurityOptions ( UIApplication application )` |
| Method | RemoveModule | 2014 | `public void RemoveModule ( MacroModule module )` |
| Method | SetUIDocumentMacroSecurityOptions | 2014 | `public static void SetUIDocumentMacroSecurityOptions ( UIApplication application , UIDocumentMacroOptions macroOptions )` |
| Method | StepInto | 2014 | `public void StepInto ( Macro macro )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MacroManager | 2014 | `public MacroManager MacroManager { get ; }` |